# Arithmetic Operations in Pandas

In [1]:
import pandas as pd 
import numpy as np

In [2]:
s1=pd.Series(np.arange(4),
             index=["a","c","d","e"])
s2=pd.Series(np.arange(5),
             index=["a","c","e","f","g"])

In [3]:
print(s1)
print(s2)

a    0
c    1
d    2
e    3
dtype: int32
a    0
c    1
e    2
f    3
g    4
dtype: int32

In [4]:
s1+s2

a    0.0
c    2.0
d    NaN
e    5.0
f    NaN
g    NaN
dtype: float64

In [5]:
df1=pd.DataFrame(
    np.arange(6).reshape(2,3),
    columns=list("ABC"),
    index=["three","four"])
df2=pd.DataFrame(
    np.arange(9).reshape(3,3),
    columns=list("ACD"),
    index=["three","four","five"])

In [6]:
print(df1)
print(df2)

       A  B  C
three  0  1  2
four   3  4  5
       A  C  D
three  0  1  2
four   3  4  5
five   6  7  8

In [7]:
df1+df2

         A   B    C   D
five   NaN NaN  NaN NaN
four   6.0 NaN  9.0 NaN
three  0.0 NaN  3.0 NaN

In [8]:
df1.add(df2,fill_value=0)

         A    B    C    D
five   6.0  NaN  7.0  8.0
four   6.0  4.0  9.0  5.0
three  0.0  1.0  3.0  2.0

In [9]:
1/df1

              A     B    C
three       inf  1.00  0.5
four   0.333333  0.25  0.2

In [10]:
df1*3

       A   B   C
three  0   3   6
four   9  12  15

In [11]:
df1.mul(3)

       A   B   C
three  0   3   6
four   9  12  15

In [12]:
df2

       A  C  D
three  0  1  2
four   3  4  5
five   6  7  8

In [13]:
s=df2.iloc[1]
s

A    3
C    4
D    5
Name: four, dtype: int32

In [14]:
df2-s

       A  C  D
three -3 -3 -3
four   0  0  0
five   3  3  3

In [15]:
s2=df2["A"]
s2

three    0
four     3
five     6
Name: A, dtype: int32

In [16]:
df2.sub(s2,axis="index")

       A  C  D
three  0  1  2
four   0  1  2
five   0  1  2

## Applying a Function

In [20]:
df=pd.DataFrame(
    np.random.randn(4,3),
    columns=list("ABC"),
    index=["three","four","five","six"])
df

              A         B         C
three -0.805104  1.232875 -1.993570
four  -0.230861 -1.203131  0.407976
five   0.629993 -0.192759 -0.518726
six   -0.002358 -0.456144  0.028954

In [21]:
np.abs(df)

              A         B         C
three  0.805104  1.232875  1.993570
four   0.230861  1.203131  0.407976
five   0.629993  0.192759  0.518726
six    0.002358  0.456144  0.028954

In [22]:
f=lambda x:x.max()-x.min()

In [23]:
df.apply(f)

A    1.435097
B    2.436006
C    2.401546
dtype: float64

In [24]:
df.apply(f,axis=1)

three    3.226445
four     1.611107
five     1.148719
six      0.485099
dtype: float64

In [25]:
def f(x):
    return x**2

In [26]:
df.apply(f)

              A         B         C
three  0.648193  1.519982  3.974321
four   0.053297  1.447524  0.166445
five   0.396891  0.037156  0.269077
six    0.000006  0.208067  0.000838